---
kind: method
id: M:Autodesk.Revit.DB.IFC.IFCAggregateIterator.Reset
source: html/8eab4ab5-1b33-869a-96a7-e8f36499aa7a.htm
---
# Autodesk.Revit.DB.IFC.IFCAggregateIterator.Reset Method

Resets the iterator to the beginning of the aggregate.

## Syntax (C#)
```csharp
public virtual void Reset()
```